---
kind: property
id: P:Autodesk.Revit.UI.UIDocument.ActiveGraphicalView
source: html/db91f0b0-7197-4a4d-91c8-43d1b9d549f2.htm
---
# Autodesk.Revit.UI.UIDocument.ActiveGraphicalView Property

The currently active graphical view of the currently active document.

## Syntax (C#)
```csharp
public View ActiveGraphicalView { get; }
```

## Remarks
This property is applicable to the currently active document only.
 Returns Nothing nullptr a null reference ( Nothing in Visual Basic) if this document doesn't represent the active document.